# Exploring Series   
 
   
## How to create a Series?

In [1]:
import pandas as pd
age = pd.Series([10,13,19,22]) #preserve the series in the variable age
age

0    10
1    13
2    19
3    22
dtype: int64

*notice that the indexes start with 0,1,2,3,...

## How to check the data type of the object?

In [2]:
type(age)

pandas.core.series.Series

## How to change the index values of a Series?

Use the index parameter

In [3]:
age = pd.Series([10,13,19,22], index=['a','b','c','d'])
age

a    10
b    13
c    19
d    22
dtype: int64

## How to acces an index in a Series?

In [4]:
age['a']

10

## How to select a series from a DataFrame?

In [5]:
users = pd.read_csv('users.csv')
users.head() #see the top five rows

   id first_name  last_name                      email  gender      ip_address
0   1    Anstice    Sincock        asincock0@wufoo.com  Female   124.76.249.59
1   2     Lethia    Timmens  ltimmens1@sourceforge.net  Female  14.193.225.111
2   3    Carolin  Hallybone      challybone2@goo.ne.jp  Female   17.45.122.149
3   4         Ad    Brewitt          abrewitt3@wsj.com    Male    117.68.14.35
4   5    Mariele      Mount             mmount4@wp.com  Female  215.176.15.211

In [6]:
users.first_name #Using dot notation

0    Anstice
1     Lethia
2    Carolin
3         Ad
4    Mariele
5       Dave
6       Base
7     Ansell
8     Joyann
9     Felipa
Name: first_name, dtype: object

In [7]:
users['first_name'] #using bracket notation

0    Anstice
1     Lethia
2    Carolin
3         Ad
4    Mariele
5       Dave
6       Base
7     Ansell
8     Joyann
9     Felipa
Name: first_name, dtype: object

*Both notations get the job but if a Series has a space in it's name(e.g. First Name), then you must use bracket notation at access that series.

## How to show the Series of a DataFrame?

In [8]:
users.columns

Index(['id', 'first_name', 'last_name', 'email', 'gender', 'ip_address'], dtype='object')

## How to create a new Series with existing Series?

In [9]:
users['full_name'] = users.first_name + ' ' + users.last_name #must use bracket notation
users.head()

,id,first_name,last_name,email,gender,ip_address,full_name
0,1,Anstice,Sincock,asincock0@wufoo.com,Female,124.76.249.59,Anstice Sincock
1,2,Lethia,Timmens,ltimmens1@sourceforge.net,Female,14.193.225.111,Lethia Timmens
2,3,Carolin,Hallybone,challybone2@goo.ne.jp,Female,17.45.122.149,Carolin Hallybone
3,4,Ad,Brewitt,abrewitt3@wsj.com,Male,117.68.14.35,Ad Brewitt
4,5,Mariele,Mount,mmount4@wp.com,Female,215.176.15.211,Mariele Mount